"""
题目: 圆圈中最后剩下的数字
题: 0, 1, ..., n-1这n个数字排成一个圆圈, 从数字0开始, 每次从这个圆圈里删除第m个数字.
求出这个圆圈里剩下的最后一个数字.
"""

"""
约瑟夫环问题

例如 11个人报数 每次删除第3个

11    0 1 2 3 4 5 6 7 8 9 10
10    8 9   0 1 2 3 4 5 6 7
 9    5 6   7 8   0 1 2 3 4
 8    2 3   4 5   6 7   0 1
 7      0   1 2   3 4   5 6
 6      4   5     0 1   2 3
 5      1   2     3 4     0
 4      3         0 1     2
 3      0         1 2
 2      0         1
 1                0

最终剩下的索引为 6

f(n, m) 为 n 个人报数, 每报到 m 的人出列, 最后剩下一个人的索引

1. 若我们已知 f(11, 3) = 6, 则 f(10, 3) = ?
    上图推导过程可知 f(10, 3) = 3
    大家都往前移 3 位
    f(10, 3) = (f(11, 3) - 3) % 11

2. 若我们已知 f(10, 3) = 3, 则 f(11, 3) = ?
    上一问题反推
    f(11, 3) = (f(10, 3) + 3) % 11

递推公式
    f(n, m) = (f(n - 1, m) + m) % n
"""

#-*-coding:utf-8-*-

class Solution:

    def LastRemaining_Solution(self, n, m):

        if n < 1 or m < 1:
            return -1

        res = 0
        for i in range(2, n + 1):
            res = (res + m) % i

        return res

        
